// backend/data/bharatDiwas.js
export const bharatDiwasMap = {
  "23-01": ["नेताजी सुभाष चन्द्र बोस जयंती"],
  "26-01": ["गणतन्त्र दिवस"],
  "30-01": ["शहीद दिवस"],
  "14-04": ["डॉ. भीमराव अंबेडकर जयंती"],
  "01-05": ["मजदूर दिवस"],
  "05-06": ["विश्व पर्यावरण दिवस"],
  "21-06": ["अंतर्राष्ट्रीय योग दिवस"],
  "15-08": ["स्वतंत्रता दिवस"],
  "02-10": ["महात्मा गांधी जयंती"],
  "31-10": ["राष्ट्रीय एकता दिवस (सरदार पटेल जयंती)"],
  "14-11": ["बाल दिवस (जवाहरलाल नेहरू जयंती)"],
  "04-12": ["नौसेना दिवस"],
  "07-12": ["सशस्त्र सेना झंडा दिवस"],
  "25-12": ["गुड गवर्नेंस डे (अटल बिहारी वाजपेयी जयंती)"]
};
